---
kind: type
id: T:Autodesk.Revit.DB.SolidCurveIntersectionMode
source: html/a5221b6d-c361-3380-a87c-29e9abe33706.htm
---
# Autodesk.Revit.DB.SolidCurveIntersectionMode

Represents the types of results available for calculating the intersection between a solid and a curve.

## Syntax (C#)
```csharp
public enum SolidCurveIntersectionMode
```